Repository: 84000/data-translation-memory
Catalog: Toh_164-The_Questions_of_Ratnacandra-v2.tmx
Source language: bo
Languages: en

source: སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་སྒྲ་དང་། རྣམ་པར་གྲོལ་བའི་སྒྲ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་སྒྲ་རྣམས་དང་ལྡན་ནོ། །
en: Furthermore, it is endowed with the sounds of ‘generosity,’ ‘discipline,’ ‘patience,’ ‘diligence,’ ‘concentration,’ ‘insight,’ ‘liberation,’ and ‘vision of the wisdom of liberation.’

source: གཞོན་ནུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྒྲ་དེ་ལྟ་བུ་དག་དང་ལྡན་པས་ན་དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྒྲ་དང་ལྡན་ཞེས་བྱའོ། །
en: Prince, since that world is endowed with such sounds, it is called Resounding.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་
en: There the thus-gone, worthy, perfect buddha Kusumaśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་། དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་མེ་ཏོག་ལྟར་མི་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་ཀྱང་གོས་པར་མི་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening and, like a flower, will be unstained by nonvirtuous phenomena.

source: གཞོན་ནུ་འདི་ནས་བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་ལྡན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, northeast of here, past countless billions of buddha realms, there is a realm called Happy .

source: འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་།
en: It is affluent, thriving, and happy.

source: ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་ཞིང་
en: It has good harvests and is inhabited by many people.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་ཤེས་པ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོས་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་
en: There the thus-gone, worthy, perfect buddha Reveling in Lesser, Medium, and Higher Superknowledge resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ་ལ་ཆོས་སྟོན་ཏོ་ཞེས་བྱ་བ་ནས་རྣམ་པར་ཤེས་པ་མེད་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: He teaches them the same Dharma mentioned previously, up until ‘consciousness.’

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་། དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་ཚུལ་ཐམས་ཅད་ལ་མཁས་ཤིང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤེས་པ་ཡང་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening, will become skilled in all the actions and ways of bodhisattvas, and will uphold the knowledge of the perfections.

source: གཞོན་ནུ་འདི་ནས་འོག་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡངས་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དོ། །
en: “Prince, below here, past countless billions of buddha realms, there is a realm called Vast Expanse.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡངས་པ་དང་ལྡན་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is that world called Vast Expanse?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ། རི་མེད་ཅིང་ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་མེད་དེ།
en: It is because it is as flat as the palm of the hand and it has no mountains, surrounding mountains, or great surrounding mountains.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་རི་ཞེས་བྱ་བའི་མིང་ཡང་ཡེ་མེད་པས་ན་དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡངས་པ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: Since even the word mountain does not exist in that buddha realm, it is called Vast Expanse.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་
en: There the thus-gone, worthy, perfect buddha Prabhāśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་། དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ཉེ་བར་ལེན་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་ཡང་རྗེས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening and will be graced with the exhaustion of all their perpetuating afflictions.

source: གཞོན་ནུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སྟེང་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད། དཔག་ཏུ་མེད། བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Prince, above here, past innumerable, unfathomable, inconceivable, and immeasurable billions of buddha realms, there is a realm called Moonlit.

source: འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ཞེས་བྱ་བ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་ཇི་སྙེད་ཅིག་འདས་པ་ན་ཡོད་ཅེ་ན།
en: How many unfathomable buddha realms must one pass through to reach Moonlit?

source: གཞོན་ནུ་འདི་ལྟ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྲིད་པའི་རྩེ་མོའི་བར་དུ་བྱེ་མས་ཡོངས་སུ་གང་བར་གྱུར་ལ།
en: Prince, it is like this. Suppose this trichiliocosm were completely filled with sand, all the way to its summits.

source: དེ་ནས་མི་ལ་ལ་ཞིག་གིས་བྱེ་མ་དེ་ལས་འབྲུ་རེ་རེ་ནས་བླངས་ཤིང་སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་བྱེ་མ་འབྲུ་རེ་རེ་འཇོག་པར་བྱེད་པ་དེ་ལྟ་བུའི་ཚུལ་གྱིས་བྱེ་མ་དེ་ཐམས་ཅད་སྟེང་གི་ཕྱོགས་སུ་ཡོངས་སུ་ཟད་ཅིང་ཡོངས་སུ་གཏུགས་པར་གྱུར་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་ཚད་དམ་མཐའ་རྟོགས་པར་མི་ནུས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དེ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ཞེས་བྱ་བ་དེ་ཡོད་དེ
en: If a person were to remove the sand, grain by grain, and place one grain of sand in each buddha realm above until every single grain of sand was placed in a buddha realm in that direction, one would still not have reached the extent and limit of those buddha realms. The realm Moonlit lies farther away than such unfathomable and innumerable billions of buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ལེགས་པར་བརྒྱན་པ། གསེར་གྱི་ས་གཞིར་འདུག་ཅིང་
en: That realm is as flat as the palm of the hand, is beautifully decorated with seven kinds of precious substances, and has a ground made of gold.

source: མིག་མངས་རིས་སུ་བྲིས་པ། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པས་ལེགས་པར་བརྒྱན་པ།
en: It is laid out in a checkered pattern and ornamented with precious trees.

source: རྩྭ་དང་། ཤིང་སྐམ་དང་། ཚེར་མ་དང་། རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་དག་མེད་པ། ངམ་གྲོག་དང་། གཡང་ས་མེད་པ། མེ་ཏོག་གི་སིལ་མ་དག་བཀྲམ་པ་ཡིན་ཏེ
en: and it is free of grass, dried sticks, thorns, stones, pebbles, gravel, ravines, and precipices. Instead, the ground is covered in flower petals.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནོར་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་
en: “There the thus-gone, worthy, perfect buddha Dhanaśrī resides and lives surrounded by a gathering of bodhisattvas who venerate him.

source: བྱང་ཆུབ་སེམས་དཔས་མདུན་གྱིས་བལྟས་པ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་
en: He is learned and venerable, a blissful one, a knower of the world, a steersman who guides beings, an unexcelled one, a teacher of gods and humans, a blessed buddha.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པའི་སྐུ་གསེར་ལེགས་པར་བཙོས་ཤིང་ལེགས་པར་དུལ་བ་ལྟ་བུ་རིན་པོ་ཆེའི་རྒྱན་
en: His body, which is adorned with the thirty-two marks of a great being, is like purified and refined gold adorned with precious ornaments.

source: ལེགས་པར་བཀོད་པ་བཞིན་དུ་འཁོར་གྱི་ནང་ན་མཛེས་པར་བཞུགས་ཤིང་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བའི་ཆོས་སྟོན་ཏོ། །
en: Sitting beautifully amidst the gathering, he teaches a Dharma that is virtuous in the beginning, virtuous in the middle, and virtuous in the end.

source: འདི་ལྟར་སའི་ཁམས་མེད་པར་མི་འགྱུར་རོ། །དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་།
en: ‘In this way the earth element will not become nonexistent, nor will the water element, the fire element, or the wind element.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེའི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ཆོས་རིན་པོ་ཆེ་བླ་ན་མེད་པ་ཡང་ཐོབ་པར་འགྱུར་རོ། །
en: Any noble son or daughter who hears his name will never turn back from unsurpassed and perfect awakening and will receive the precious and unsurpassed Dharma.

source: གཞོན་ནུ་དེ་ལྟར་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤྱོད་པ་དང་། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་དང་། ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ་དེ་དག་གི་མཚན་ཐོས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: “Prince, any noble son or daughter who hears the names of these thus-gone, worthy, perfect buddhas, who are endowed with perfect conduct, qualities, wisdom, discipline, absorption, insight, liberation, and the vision of the wisdom of liberation, will never turn back from unsurpassed and perfect awakening.

source: གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ་ཡུན་རིང་པོ་ཚད་མེད་པ་འདས་པ་དེའི་ཚེ་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བའི་བསྐལ་པ་ཞིག་བྱུང་སྟེ།
en: “Prince, long ago in the past, eons beyond calculation and measure, there was an eon by the name of Ratnākara .

source: དེར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: In that eon appeared the thus-gone, worthy, perfect buddha Sāgaraśrī.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྒྱ་མཚོའི་དཔལ་ཞེས་བྱ་བ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: He was learned and venerable, a blissful one, a knower of the world, a steersman who guides beings, an unexcelled one, a teacher of gods and humans, a blessed buddha.

source: དེར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅུ་པོ་འདི་དག་ཐམས་ཅད་ལྷན་ཅིག་ཏུ་འཐུན་པར་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ། ཟས་དང་། སྐོམ་དང་། བཟའ་བ་དང་། བཅའ་བ་རྣམ་པ་སྣ་ཚོགས་དང་། མེ་ཏོག་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྣམ་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པས་བཅོམ་ལྡན་འདས་དེ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་
en: At that time, these ten thus-gone, worthy, perfect buddhas came together to generate roots of virtue by making boundless and countless grand offerings of food and drink, flowers, incense, flower garlands, lotions, parasols, banners, and flags to that blessed one.

source: བྱས་ནས་ཐམས་ཅད་ཀྱིས་ལྷན་ཅིག་ཏུ་འཐུན་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Thereby all of them together generated the mind set upon unsurpassed and perfect awakening.

source: ཐམས་ཅད་ཀྱིས་ཉི་མ་གཅིག་ཏུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Then, one day, at precisely the same moment, they all achieved acceptance that phenomena are unborn.

source: དེ་ནས་དེ་དག་གིས་རིམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་ནས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ།
en: Thereafter they gradually engaged in bodhisattva conduct and mastered the factors that are conducive for awakening.

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Then, at precisely the same moment, they all attained unsurpassed and perfect awakening in each of their respective buddha realms.

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་དེ་དག་གིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ། །
en: At precisely the same moment, they all turned the wheel of Dharma.

source: ཐམས་ཅད་ཀྱི་ཚེའི་ཚད་ཀྱང་མཉམ་མོ། །
en: They even enjoyed the same lifespan.

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱང་ཉི་མ་གཅིག་ཏུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: Prince, these thus-gone, worthy, perfect buddhas will also one day enter into complete nirvāṇa at precisely the same moment.”

source: བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Blessed One, the lifespan of those thus-gone, worthy, perfect buddhas is amazing!

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་སྐུ་ཚེའི་ཚད་ནི་ངོ་མཚར་ལགས་ཏེ།
en: Blessed One, out of compassion for sentient beings, those thus-gone ones intentionally live such long lives.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ནི་སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་སྐུ་ཚེའི་ཚད་དེ་ཙམ་དུ་རིང་བ་གཞེས་ལགས་སོ། །བཅོམ་ལྡན་འདས་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་སྐུ་ཚེའི་ཚད་འདི་ལ་དེ་བཞིན་དུ་འཛིན་ཅིང་ཡིད་ཆེས་ལ་སྤོང་བར་མི་བགྱིད། འདོར་བར་མི་བགྱིད་པ་དེ་ལ་བསོད་ནམས་ཇི་ཙམ་སྐྱེ་བར་འགྱུར་ལགས།
en: Blessed One, how much merit will noble sons or daughters generate if they keep the lifespan of those thus-gone ones in mind and trust in it without disregarding it or ignoring it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Buddha replied,

source: གཞོན་ནུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། དེ་བཞིན་གཤེགས་པ་བཅུ་པོ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བཅུ་པོ་རྣམས་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཉིན་གཅིག་བཞིན་དུ་སྦྱིན་པ་བྱིན་ཏེདེ་ལྟ་བུར་བསྐལ་པ་གྲངས་མེད་པར་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ལ།
en: “Prince, one could fill up this entire trichiliocosm, along with the buddha realms of these ten thus-gone ones and the other buddha realms in the ten directions, with the seven precious substances of the gods and make daily offerings of them to the thus-gone, worthy, perfect buddhas, continuing this daily offering for countless eons.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་མཚན་འདི་རྣམས་དང་། སྐུ་ཚེའི་ཚད་འདི་རྣམས་ཐོས་ནས་དེ་བཞིན་དུ་འཛིན་ཅིང་ཡིད་ཆེས་ལ་སྤོང་བར་མི་བྱེད། སྨོད་པར་མི་བྱེད་དེ།
en: On the other hand, a noble son or daughter who has heard about the names and lifespan of these buddhas may keep them faithfully in mind without disregarding or disrespecting them and instead trust and agree with them.

source: མོས་པར་བྱེད་ཅིང་འཐུན་པར་བྱེད་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་
en: For that person the heap of merit accrued is far greater than that gathered by the former person.

source: དེས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད། སྟོང་གི་ཆ་དང་། དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: The former does not gather even a hundredth or a thousandth of that. It is, in fact, beyond the scope of illustration.”

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་བུ་དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དཔལ་ལྡན་ལེགས་དང་། དགའ་ལྡན་དང་། ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་གྱིས་འདི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། དེ་བཞིན་གཤེགས་པ་བཅུ་པོ་དེ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་མེ་ཏོག་དང་། ཙན་དན་གྱི་ཕྱེ་མས་གཏོར། མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། །
en: Then, in order to venerate this teaching and the ten thus-gone ones, Śakra king of the gods, Brahmā lord of the Enduring world, the Four Great Kings, and the divine sons Īśvara, Maheśvara, Glorious Fortune, Tuṣita, and Santuṣita scattered divine flowers and sandalwood powder upon the Thus-Gone One.

source: ཚིག་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ།
en: Then they spoke these words:

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། རྗོད་པར་བགྱིད་པ་དེ་དག་ནི་ཕྱག་བགྱི་བའི་འོས་ལགས་སོ། །
en: “Blessed One, any noble son or daughter who retains, carries, reads, and recites this teaching is worthy of reverence.

source: བཅོམ་ལྡན་འདས་ཐ་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གིས་སུག་པ་ན་མཆིས་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ལགས་སོ། །
en: Blessed One, merely holding this teaching in their hand, they will never turn back from unsurpassed and perfect awakening.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་གི་རྣ་ལམ་དུ་གྲགས་པར་འགྱུར་བ་དེ་དག་ནི་བདུད་སྡིག་ཅན་གྱི་དབང་དུ་མཆིས་པར་མི་འགྱུར་ལགས་སོ། །
en: Blessed One, any noble son or daughter who hears this teaching will not fall under the sway of the evil Māra.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བས་ཚིགས་སུ་བཅད་པས་གསོལ་པ།
en: At that point Prince Ratna­candra, son of King Bimbisāra, addressed the following verses to the Blessed One:

source: ཕུང་པོ་མེད་པ་བཅོམ་ལྡན་འདས། །
en: “Blessed One, you are beyond the aggregates!

source: ཁྱོད་ཀྱིས་ལེགས་གསུངས་དཔག་ཏུ་མེད། །
en: Your eloquent teachings are beyond measure.

source: བདག་དང་ལྷར་བཅས་འཇིག་རྟེན་རྣམས། །ཁྱོད་ཀྱིས་འདི་ལ་ཡི་རང་ངོ་། །
en: I and the entire world, along with its gods, Rejoice in the teachings you have given.

source: འཇིག་རྟེན་མགོན་པོ་འདས་པ་ན། །གང་དག་ད་དུང་མ་བྱོན་དང་། །ཕྱོགས་རྣམས་མ་ལུས་གང་བཞུགས་པའི། །སངས་རྒྱས་རྣམས་ལ་སྐྱབས་སུ་མཆིས། །
en: “We take refuge in the world protectors Who have passed, who are yet to come, And in the buddhas who are present, Residing in all directions.

source: སངས་རྒྱས་རྣམས་ཀྱི་ཡུལ་གཅིག་པ། །ཆོས་དང་དགེ་འདུན་ཞི་བའི་མཆོག །
en: “Of common purpose with all the buddhas, The Dharma and Saṅgha are the utmost peace.

source: ཡོན་ཏན་ལེགས་པར་བསམ་མི་ཁྱབ། །
en: Their perfect qualities are inconceivable.

source: དགེ་འདུན་ལ་ཡང་སྐྱབས་སུ་མཆིས། །
en: We take refuge in the Saṅgha too.

source: བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་པ་མེད། །གང་དག་བཟོད་ལ་རབ་གནས་ཤིང་། །གང་དག་གཟུངས་ལ་གནས་པ་དང་། །གང་དག་མཚུངས་མེད་སྟོང་ཉིད་ཚུལ། །
en: “The fearless bodhisattvas Are stable in patience, Grounded in recall, And maintain incomparable emptiness.

source: མཚན་ཉིད་ཀྱི་ནི་མདོ་སྡེ་དང་། །བྱང་ཆུབ་རྒྱུར་འགྱུར་སྡེ་སྣོད་དང་། །འཐུན་པར་འཇུག་པའི་མདོ་སྡེ་ལ། །
en: “These bodhisattvas train well In the sūtras of characteristics, The scriptures that lead to awakening, And the sūtras that conform to both.

source: ལེགས་བསླབས་བྱང་ཆུབ་སེམས་རྣམས་ལྟར། །ཐུབ་པ་བདག་ནི་བྱང་ཆུབ་ཀྱི། །སྤྱད་པ་སྤྱོད་ཅིང་སློབ་པར་འཚལ། །
en: “Sage, like them, we too wish to train In the conduct of awakening.

source: རང་བྱུང་དེ་དག་ཇི་བཞིན་དུ། །ཞིང་གི་བཀོད་པ་རྣམ་དག་དང་། །
en: You have taught about those naturally arisen ones, The pure arrangement of their realms,

source: སྤྱོད་དང་སྤྱོད་ཡུལ་ཏིང་འཛིན་དང་། །དེ་དག་གི་ནི་ཡོན་ཏན་དང་། །དྲང་སྲོང་མཆོག་རྣམས་སྐུ་ཚེའི་ཚད། །
en: “And their practices, domains, and absorptions, As well as their qualities And the lifespan of these supreme sages.

source: གསུངས་པ་གང་ལགས་རྫོགས་པར་བགྱི། །
en: Now I too will accomplish these qualities.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་དག་དང་། རིན་ཆེན་ཟླ་བ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One commended the gods and Ratna­candra, and addressed them with the following verses:

source: འཇིག་རྟེན་མགོན་པོ་དེ་རྣམས་ཀྱི། །མཚན་ནི་གང་ཞིག་འཛིན་བྱེད་པ། །མ་འོངས་དུས་ན་དེ་དག་ཀུན། །རྐང་གཉིས་རྣམས་ཀྱི་མཆོག་ཏུ་འགྱུར། །
en: “All who recall the names Of these protectors of the world Will, in future times, Become supreme among humans.

source: ང་ཡིས་ཇི་སྐད་གསུངས་པ་བཞིན། །དྲང་སྲོང་མཆོག་བཞུགས་དེ་དག་ལྟར། །དེ་དག་ཚེ་ཡང་བསྐལ་པ་ནི། །བྱེ་བ་བསམ་ཡས་སྙེད་དུ་འགྱུར། །
en: “They too will live For inconceivably many millions of eons, Like the lifespan of these supreme sages, Which I have just described.

source: གང་ཞིག་སྐྱོབ་པ་དེ་དག་གི ། མཚན་འདི་དག་ནི་འཛིན་འདི་ལ། །མེ་དང་ཆོམ་རྐུན་དུག་རྣམས་དང་། །མཚོན་གྱིས་ཚུགས་པར་མི་འགྱུར་རོ། །
en: “Those who recall the names Of these protectors Will be unharmed by fire, bandits, Poison, and weapons.

source: མཚན་འདི་དག་ནི་འཛིན་བྱེད་ན། །ཆུ་ཆེན་དག་གིས་དེ་མི་འཆི། །རྒྱལ་པོའི་གནོད་པས་མ་ཡིན་ཏེ། །དེ་ནི་ནམས་ཀྱང་ཆོས་མི་སྤོང་། །
en: “Whoever recalls the names of these buddhas Will never drown in rivers, Will never be subject to royal punishment, And will never forsake the Dharma.

source: མཚན་མོ་ཐུན་ཚོད་དང་པོ་དང་། །གུང་དང་ཐ་མའང་དེ་བཞིན་ཏེ། །
en: In the first watch of the night And in the middle and last watches as well.

source: དུས་གསུམ་དག་ཏུ་མཚན་སྒྲོགས་དང་། །
en: “Recite these names at three times:

source: དྲང་སྲོང་མཆོག་ནི་དེ་དག་གི། །མཚན་རྣམས་སྔ་དྲོ་སྒྲོགས་བྱེད་ཅིང་། །ཉི་མའི་གུང་ལ་སྒྲོགས་བྱེད་དང་། །མཁས་པ་ནུབ་ཀར་སྒྲོགས་བྱེད་པ། །རྨི་ལམ་བཟང་པོ་མཐོང་བར་འགྱུར། །
en: Wise ones who recite the names “Of these supreme sages In the morning, at noon, And in the evening Will have good dreams.

source: མཚན་རྣམས་བཟུང་ནས་དེ་འོག་ཏུ། །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་སུ། །སྔོན་ཆད་སྡིག་པ་ཅི་བསགས་པ། །མི་དགེ་ཐམས་ཅད་བཤགས་པར་བྱ། །
en: “Next, having recalled these names, One must confess all the negative deeds One has committed Over the course of billions of eons.

source: དེ་ཡིས་ལུས་ངག་ཡིད་ཀྱི་ལས། །མི་དགེ་གང་དག་བྱས་གྱུར་ན། །མཚན་རྣམས་བཟུང་ནས་དེ་འོག་ཏུ། །ཉེས་བྱས་དེ་ཡང་བཤགས་པར་བྱ། །
en: “Any negative deed committed By way of body, speech, and mind After one has recalled these names Must also be confessed.

source: ཡན་ལག་ལྔ་ཡིས་གཏུགས་ནས་ནི། །རྒྱལ་རྣམས་བྱང་ཆུབ་སྔོན་རོལ་དུ། །དུས་གསུམ་དགེ་བ་ཅི་བསགས་པ། །དེ་ཀུན་རྗེས་སུ་ཡི་རང་བྱ། །
en: “Touching one’s five points to the ground, One should rejoice in the merit Of all the wholesome deeds accumulated By the victors prior to awakening.

source: འཇིག་རྟེན་རྩ་ལག་རྣམས་ཀྱིས་ནི། །བྱང་ཆུབ་བརྙེས་ནས་ཆོས་གསུངས་དང་། །ལུས་ཅན་གང་དག་འཇིག་རྟེན་གྱི། །མགོན་པོ་རྣམས་ལ་མཆོད་བྱེད་པ། །
en: “Having attained awakening, The kinsmen of the world taught the Dharma, And all beings made offerings To the protectors of the world.

source: དེ་ལ་རྒྱལ་བའི་སྲས་རྣམས་ཀྱིས། །ཉིན་མཚན་དུས་གསུམ་ཡི་རང་བྱ། །
en: “The children of the victors should rejoice in them Three times during the day and night.

source: དེས་ན་བདག་གཞན་དོན་བྱེད་པའི། །ཕ་རོལ་ཕྱིན་པ་རྫོགས་པར་འགྱུར། །
en: In this way the perfections that benefit self and others Shall be accomplished.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Blessed One had spoken these words,

source: རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་སྲས་ཁྱེའུ་རིན་ཆེན་ཟླ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་ཡི་རངས་ཏེ་མངོན་པར་བསྟོད་དོ། །
en: the youth Ratna­candra, son of King Bimbisāra, along with all the bodhisattvas, monks, gods, humans, asuras, and gandharvas, rejoiced in the Buddha’s teaching and offered praise.

source: འཕགས་པ་རིན་ཆེན་ཟླ་བས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Great Vehicle sūtra “ The Questions of Ratna­candra .”

source: རྒྱ་གར་གྱི་མཁན་པོ་བི་ཤུདྡྷ་སིང་ཧ་དང་། ལོཙྪ་བ་བནྡེ་དགེ་བ་དཔལ་གྱིས་བསྒྱུར།
en: The Indian scholar Viśuddha­siṃha and the translator Venerable Gewa Pal translated this.

source: རྒྱ་གར་གྱི་མཁན་པོ་པིདྱཱ་ཀ་ར་སིདྷ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་དེ་བ་ཙན་དྲས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Later, the Indian scholar Vidyākara­siṃha and the editor-translator monk Devacandra edited and finalized it.
